ART-Badge/SDK/libraries/inc/peripheral/rtl876x_bitfields.h
/* Copyright (c) 2015 Realtek Semiconductor. All Rights Reserved.
 *
 *  The information contained herein is property of Realtek Semiconductor.
 *  Terms and conditions of usage are described in detail in Realtek
 *  SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 *   Licensees are granted free, non-transferable use of the information. NO
 *   WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 *   the file.
 *
 */
#ifndef __RTL876X_BITS_H
#define __RTL876X_BITS_H

#ifdef __cplusplus
extern "C" {
#endif

#include <core_cm4.h>

/* Peripheral: KEYSCAN */
/* Description: Key Scan. */


/* Register: RTL_KEYSCAN_CR0 */
/* Description: Control register 0. */

/* Bit 31 : Keyscan clock enable */
#define KEYSCAN_CR0_CLKEN_Pos (31UL) /*!< Position of clock enable field. */
#define KEYSCAN_CR0_CLKEN_Msk (0x1UL << KEYSCAN_CR0_CLKEN_Pos) /*!< Bit mask of clock enable field. */
#define KEYSCAN_CR0_CLKEN_Disabled (0UL) /*!< Clock disabled. */
#define KEYSCAN_CR0_CLKEN_Enabled (1UL) /*!< Clock enabled. */

/* Bit 8 : Column selection */
#define KEYSCAN_CR0_COLSEL_Pos (8UL) /*!< Position of column selection field. */
#define KEYSCAN_CR0_COLSEL_Msk (0xFFFFFUL << KEYSCAN_CR0_COLSEL_Pos) /*!< Bit mask of column selection field. */

/* Bit 5 : Row number */
#define KEYSCAN_CR0_ROWNUM_Pos (5UL) /*!< Position of row number field. */
#define KEYSCAN_CR0_ROWNUM_Msk (0x07UL << KEYSCAN_CR0_ROWNUM_Pos) /*!< Bit mask of row number field. */


/* Bit 0 : Column number */
#define KEYSCAN_CR0_COLNUM_Pos (0UL) /*!< Position of column number field. */
#define KEYSCAN_CR0_COLNUM_Msk (0x1FUL << KEYSCAN_CR0_COLNUM_Pos) /*!< Bit mask of column number field. */

/* Register: RTL_KEYSCAN_CR1 */
/* Description: Control register 1. */

/* Bit 27 : Post guard time for column*/
#define KEYSCAN_CR1_POSTGUARD_Pos (27UL) /*!< Position of post guard time field. */
#define KEYSCAN_CR1_POSTGUARD_Msk (0x07UL << KEYSCAN_CR1_POSTGUARD_Pos) /*!< Bit mask of post guard time field. */

/* Bit 24 : Pre guard time for column */
#define KEYSCAN_CR1_PREGUARD_Pos (24UL) /*!< Position pre guard time field. */
#define KEYSCAN_CR1_PREGUARD_Msk (0x07UL << KEYSCAN_CR1_PREGUARD_Pos) /*!< Bit mask of pre guard time field. */

/* Bit 16 : Row selection */
#define KEYSCAN_CR1_ROWSEL_Pos (16UL) /*!< Position of  row selection field. */
#define KEYSCAN_CR1_ROWSEL_Msk (0xFFUL << KEYSCAN_CR1_ROWSEL_Pos) /*!< Bit mask of row selection field. */

/* Bit 8 : Detection period */
#define KEYSCAN_CR1_DETECTPERIOD_Pos (8UL) /*!< Position of detection period field. */
#define KEYSCAN_CR1_DETECTPERIOD_Msk (0x07UL << KEYSCAN_CR1_DETECTPERIOD_Pos) /*!< Bit mask of detection period field. */
#define KEYSCAN_CR1_DETECTPERIOD_Disabled (0UL) /*!< Detection disabled. */
#define KEYSCAN_CR1_DETECTPERIOD_Enabled (1UL) /*!< Detection enabled. */

/* Bit 7 : Debouncing enable */
#define KEYSCAN_CR1_DEBOUNCEN_Pos (7UL) /*!< Position of debouncing enable field. */
#define KEYSCAN_CR1_DEBOUNCEN_Msk (0x01UL << KEYSCAN_CR1_DEBOUNCEN_Pos) /*!< Bit mask of debouncing enable field. */
#define KEYSCAN_CR1_DEBOUNCEN_Disabled (0UL) /*!< Debouncing disabled. */
#define KEYSCAN_CR1_DEBOUNCEN_Enabled (1UL) /*!< Debouncing enabled. */

/* Bit 2 : Timeout period */
#define KEYSCAN_CR1_TOPERIOD_Pos (2UL) /*!< Position of timeout period field. */
#define KEYSCAN_CR1_TOPERIOD_Msk (0x03UL << KEYSCAN_CR1_TOPERIOD_Pos) /*!< Bit mask of timeout period field. */

/* Bit 0 : Wait period */
#define KEYSCAN_CR1_WAITPERIOD_Pos (0UL) /*!< Position of wait period field. */
#define KEYSCAN_CR1_WAITPERIOD_Msk (0x03UL << KEYSCAN_CR1_WAITPERIOD_Pos) /*!< Bit mask of wait period field. */


/* Register: RTL_KEYSCAN_CR2 */
/* Description: Control register 2. */

/* Bit 27 : Program debouncing time enable */
#define KEYSCAN_CR2_DEBEN_Pos (27UL) /*!< Position of program debouncing time enable field. */
#define KEYSCAN_CR2_DEBEN_Msk (0x1UL << KEYSCAN_CR2_DEBEN_Pos) /*!< Bit mask of program debouncing time enable  field. */
#define KEYSCAN_CR2_DEBEN_Disabled (0UL) /*!< Clock disabled. */
#define KEYSCAN_CR2_DEBEN_Enabled (1UL) /*!< Clock enabled. */

/* Bit 16 : Debouncing time*/
#define KEYSCAN_CR2_DEBTIME_Pos (16UL) /*!< Position of debouncing time field. */
#define KEYSCAN_CR2_DEBTIME_Msk (0x3FFUL << KEYSCAN_CR2_DEBTIME_Pos) /*!< Bit mask of debouncing time field. */

/* Bit 15 : FIFO clear */
#define KEYSCAN_CR2_FIFOCLEAR_Pos (15UL) /*!< Position of FIFO clear field. */
#define KEYSCAN_CR2_FIFOCLEAR_Msk (0x1UL << KEYSCAN_CR2_FIFOCLEAR_Pos) /*!< Bit mask of FIFO clear field. */

/* Bit 14 : Force scan fsm idle */
#define KEYSCAN_CR2_FSMIDLE_Pos (14UL) /*!< Position of force scan fsm idle field. */
#define KEYSCAN_CR2_FSMIDLE_Msk (0x1UL << KEYSCAN_CR2_FSMIDLE_Pos) /*!< Bit mask of force scan fsm idle field. */

/* Bit 13 : FIFO flag clear1 */
#define KEYSCAN_CR2_FIFOFLAGCLR1_Pos (13UL) /*!< Position of FIFO flag clear1 field. */
#define KEYSCAN_CR2_FIFOFLAGCLR1_Msk (0x1UL << KEYSCAN_CR2_FIFOFLAGCLR1_Pos) /*!< Bit mask of FIFO flag clear1 field. */

/* Bit 12 : FIFO flag clear2 */
#define KEYSCAN_CR2_FIFOFLAGCLR2_Pos (12UL) /*!< Position of FIFO flag clear2 field. */
#define KEYSCAN_CR2_FIFOFLAGCLR2_Msk (0x1UL << KEYSCAN_CR2_FIFOFLAGCLR2_Pos) /*!< Bit mask of FIFO flag clear2 field. */

/* Bit 7 : Key scan trigger type */
#define KEYSCAN_CR2_TRIGTYPE_Pos (7UL) /*!< Position of ey scan trigger type field. */
#define KEYSCAN_CR2_TRIGTYPE_Msk (0x1UL << KEYSCAN_CR2_TRIGTYPE_Pos) /*!< Bit mask of key scan trigger type field. */
#define KEYSCAN_CR2_TRIGTYPE_EDGE (0UL) /*!< Edge trigger */
#define KEYSCAN_CR2_TRIGTYPE_LEVEL (1UL) /*!< Level trigger */

/* Bit 6 : FIFO overflow control */
#define KEYSCAN_CR2_FIFOOVCTL_Pos (6UL) /*!< Position of FIFO overflow control field. */
#define KEYSCAN_CR2_FIFOOVCTL_Msk (0x1UL << KEYSCAN_CR2_FIFOOVCTL_Pos) /*!< Bit mask of FIFO overflow control field. */
#define KEYSCAN_CR2_FIFOOVCTL_DISCARDNEW (0UL) /*!< Discard all the new scan data when FIFO is full. */
#define KEYSCAN_CR2_FIFOOVCTL_DISCARDOLD (1UL) /*!< Discard the last scan data when FIFO is full. */

