ART-Badge/SDK/libraries/inc/peripheral/rtl876x_bitfields.h
/* Register: REG_SOC_FUNC_EN */
/* Description: REG_SOC_FUNC_EN. */

/* Bit 16 : BIT_SOC_GTIMER_EN. 1: enable GTIMER IP and GTIMER register */
#define SYSBLK_GTIMER_EN_Pos (16UL) /*!< Position of  */
#define SYSBLK_GTIMER_EN_Msk (0x1UL << SYSBLK_GTIMER_EN_Pos) /*!< Bit mask of  */

/* Bit 13 : BIT_SOC_GDMA0_EN. 1: Enable GDMA block */
#define SYSBLK_GDMA0_EN_Pos (13UL) /*!< Position of . */
#define SYSBLK_GDMA0_EN_Msk (0x1UL << SYSBLK_GDMA0_EN_Pos) /*!< Bit mask of  */

/* Bit 12 : BIT_SOC_LOG_UART_EN. 1: enable log UART; 0: disable log UART */
#define SYSBLK_LOGUART_EN_Pos (12UL) /*!< Position of . */
#define SYSBLK_LOGUART_EN_Msk (0x1UL << SYSBLK_LOGUART_EN_Pos) /*!< Bit mask of  */

/* Bit 5 : BIT_SOC_eFLASH_EN. 1. enable eflash controller */
#define SYSBLK_EFLASH_EN_Pos (5UL) /*!< Position of . */
#define SYSBLK_EFLASH_EN_Msk (0x1UL << SYSBLK_EFLASH_EN_Pos) /*!< Bit mask of  */

/* Bit 4 : BIT_SOC_FLASH_EN. 1: enaable flash controller */
#define SYSBLK_EXTFLASH_EN_Pos (4UL) /*!< Position of . */
#define SYSBLK_EXTFLASH_EN_Msk (0x1UL << SYSBLK_EXTFLASH_EN_Pos) /*!< Bit mask of  */

/* Bit 2 : BIT_SOC_BTBUS_EN. 1: enable BT function */
#define SYSBLK_BTBUS_EN_Pos (2UL) /*!< Position of . */
#define SYSBLK_BTBUS_EN_Msk (0x1UL << SYSBLK_BTBUS_EN_Pos) /*!< Bit mask of  */


/* Register: REG_SOC_PERI_FUNC0_EN */
/* Description: REG_SOC_PERI_FUNC0_EN. */

/* Bit 24 : BIT_PERI_SPI2W_EN. 1: enable 2-wire/3-wire SPI interface */
#define SYSBLK_SPI2W_EN_Pos (24UL) /*!< Position of  */
#define SYSBLK_SPI2W_EN_Msk (0x1UL << SYSBLK_SPI2W_EN_Pos) /*!< Bit mask of  */

/* Bit 19 : BIT_PERI_KEYSCAN_EN. 1: enable KEYSCAN interface */
#define SYSBLK_KEYSCAN_EN_Pos (19UL) /*!< Position of . */
#define SYSBLK_KEYSCAN_EN_Msk (0x1UL << SYSBLK_KEYSCAN_EN_Pos) /*!< Bit mask of  */

/* Bit 18 : BIT_PERI_QDECODE_EN. 1: enable QDECODE interface */
#define SYSBLK_QDECODE_EN_Pos (18UL) /*!< Position of . */
#define SYSBLK_QDECODE_EN_Msk (0x1UL << SYSBLK_QDECODE_EN_Pos) /*!< Bit mask of  */

/* Bit 17 : BIT_PERI_I2C1_EN. 1: enable I2C1 interface */
#define SYSBLK_I2C1_EN_Pos (17UL) /*!< Position of . */
#define SYSBLK_I2C1_EN_Msk (0x1UL << SYSBLK_I2C1_EN_Pos) /*!< Bit mask of  */

/* Bit 16 : BIT_PERI_I2C0_EN. 1: enable I2C0 interface */
#define SYSBLK_I2C0_EN_Pos (16UL) /*!< Position of . */
#define SYSBLK_I2C0_EN_Msk (0x1UL << SYSBLK_I2C0_EN_Pos) /*!< Bit mask of  */

/* Bit 10 : BIT_PERI_IR_EN. 1: enable IR interface */
#define SYSBLK_IR_EN_Pos (10UL) /*!< Position of . */
#define SYSBLK_IR_EN_Msk (0x1UL << SYSBLK_IR_EN_Pos) /*!< Bit mask of  */

/* Bit 9 : BIT_PERI_SPI1_EN. 1: enable SPI1 interface */
#define SYSBLK_SPI1_EN_Pos (9UL) /*!< Position of . */
#define SYSBLK_SPI1_EN_Msk (0x1UL << SYSBLK_SPI1_EN_Pos) /*!< Bit mask of  */

/* Bit 8 : BIT_PERI_SPI0_EN. 1: enable SPI0 interface */
#define SYSBLK_SPI0_EN_Pos (8UL) /*!< Position of . */
#define SYSBLK_SPI0_EN_Msk (0x1UL << SYSBLK_SPI0_EN_Pos) /*!< Bit mask of  */

/* Bit 1 : BIT_PERI_UART1_EN. 1; enable UART1 interface ( DATA Uart1) */
#define SYSBLK_UART1_EN_Pos (1UL) /*!< Position of . */
#define SYSBLK_UART1_EN_Msk (0x1UL << SYSBLK_UART1_EN_Pos) /*!< Bit mask of  */

/* Bit 0 : BIT_PERI_UART0_EN. 1; enable UART0 interface ( DATA Uart) */
#define SYSBLK_UART0_EN_Pos (0UL) /*!< Position of . */
#define SYSBLK_UART0_EN_Msk (0x1UL << SYSBLK_UART0_EN_Pos) /*!< Bit mask of  */


/* Register: REG_SOC_PERI_FUNC1_EN */
/* Description: REG_SOC_PERI_FUNC1_EN. */

/* Bit 8 : BIT_PERI_GPIO_EN. 1: enable DW GPIO */
#define SYSBLK_GPIO_EN_Pos (8UL) /*!< Position of  */
#define SYSBLK_GPIO_EN_Msk (0x1UL << SYSBLK_GPIO_EN_Pos) /*!< Bit mask of  */

/* Bit 0 : BIT_PERI_ADC_EN. 1: enable ADC */
#define SYSBLK_ADC_EN_Pos (0UL) /*!< Position of . */
#define SYSBLK_ADC_EN_Msk (0x1UL << SYSBLK_ADC_EN_Pos) /*!< Bit mask of  */


/* Register: REG_PESOC_CLK_CTRL */
/* Description: REG_PESOC_CLK_CTRL. */

/* Bit 25 : BIT_SOC_SLPCK_GPIO_EN */
#define SYSBLK_SLPCK_GPIO_EN_Pos (25UL) /*!< Position of  */
#define SYSBLK_SLPCK_GPIO_EN_Msk (0x1UL << SYSBLK_SLPCK_GPIO_EN_Pos) /*!< Bit mask of  */

/* Bit 24 : BIT_SOC_ACTCK_GPIO_EN */
#define SYSBLK_ACTCK_GPIO_EN_Pos (24UL) /*!< Position of  */
#define SYSBLK_ACTCK_GPIO_EN_Msk (0x1UL << SYSBLK_ACTCK_GPIO_EN_Pos) /*!< Bit mask of  */

/* Bit 17 : BIT_SOC_SLPCK_GDMA0_EN */
#define SYSBLK_SLPCK_GDMA0_EN_Pos (17UL) /*!< Position of  */
#define SYSBLK_SLPCK_GDMA0_EN_Msk (0x1UL << SYSBLK_SLPCK_GDMA0_EN_Pos) /*!< Bit mask of  */

/* Bit 16 : BIT_SOC_ACTCK_GDMA0_EN */
#define SYSBLK_ACTCK_GDMA0_EN_Pos (16UL) /*!< Position of  */
#define SYSBLK_ACTCK_GDMA0_EN_Msk (0x1UL << SYSBLK_ACTCK_GDMA0_EN_Pos) /*!< Bit mask of  */

/* Bit 15 : BIT_SOC_SLPCK_TIMER_EN */
#define SYSBLK_SLPCK_TIMER_EN_Pos (15UL) /*!< Position of  */
#define SYSBLK_SLPCK_TIMER_EN_Msk (0x1UL << SYSBLK_SLPCK_TIMER_EN_Pos) /*!< Bit mask of  */

/* Bit 14 : BIT_SOC_ACTCK_TIMER_EN */
#define SYSBLK_ACTCK_TIMER_EN_Pos (14UL) /*!< Position of  */
#define SYSBLK_ACTCK_TIMER_EN_Msk (0x1UL << SYSBLK_ACTCK_TIMER_EN_Pos) /*!< Bit mask of  */

/* Bit 13 : BIT_SOC_SLPCK_LOG_UART_EN */
#define SYSBLK_SLPCK_LOGUART_EN_Pos (13UL) /*!< Position of  */
#define SYSBLK_SLPCK_LOGUART_EN_Msk (0x1UL << SYSBLK_SLPCK_LOGUART_EN_Pos) /*!< Bit mask of  */

/* Bit 12 : BIT_SOC_ACTCK_LOG_UART_EN */
#define SYSBLK_ACTCK_LOGUART_EN_Pos (12UL) /*!< Position of  */
#define SYSBLK_ACTCK_LOGUART_EN_Msk (0x1UL << SYSBLK_ACTCK_LOGUART_EN_Pos) /*!< Bit mask of  */

/* Bit 11 : BIT_SOC_SLPCK_UART1_DATA_EN */
#define SYSBLK_SLPCK_UART1DATA_EN_Pos (11UL) /*!< Position of  */
#define SYSBLK_SLPCK_UART1DATA_EN_Msk (0x1UL << SYSBLK_SLPCK_UART1DATA_EN_Pos) /*!< Bit mask of  */

/* Bit 10 : BIT_SOC_ACTCK_UART1_DATA_EN */
#define SYSBLK_ACTCK_UART1DATA_EN_Pos (10UL) /*!< Position of  */
#define SYSBLK_ACTCK_UART1DATA_EN_Msk (0x1UL << SYSBLK_ACTCK_UART1DATA_EN_Pos) /*!< Bit mask of  */

/* Bit 9 : BIT_SOC_SLPCK_FLASH_EN */
#define SYSBLK_SLPCK_FLASH_EN_Pos (9UL) /*!< Position of  */
#define SYSBLK_SLPCK_FLASH_EN_Msk (0x1UL << SYSBLK_SLPCK_FLASH_EN_Pos) /*!< Bit mask of  */

/* Bit 8 : BIT_SOC_ACTCK_FLASH_EN */
#define SYSBLK_ACTCK_FLASH_EN_Pos (8UL) /*!< Position of  */
#define SYSBLK_ACTCK_FLASH_EN_Msk (0x1UL << SYSBLK_ACTCK_FLASH_EN_Pos) /*!< Bit mask of  */

/* Bit 7 : BIT_SOC_SLPCK_VENDOR_REG_EN */
#define SYSBLK_SLPCK_VENDORREG_EN_Pos (7UL) /*!< Position of  */
#define SYSBLK_SLPCK_VENDORREG_EN_Msk (0x1UL << SYSBLK_SLPCK_VENDORREG_EN_Pos) /*!< Bit mask of  */

/* Bit 6 : BIT_SOC_ACTCK_VENDOR_REG_EN */
#define SYSBLK_ACTCK_VENDORREG_EN_Pos (6UL) /*!< Position of  */
#define SYSBLK_ACTCK_VENDORREG_EN_Msk (0x1UL << SYSBLK_ACTCK_VENDORREG_EN_Pos) /*!< Bit mask of  */

/* Bit 3 : BIT_CKE_EFC. Embedded flash controller clock enable */
#define SYSBLK_EFLASH_CLK_EN_Pos (3UL) /*!< Position of  */
#define SYSBLK_EFLASH_CLK_Msk (0x1UL << SYSBLK_EFLASH_CLK_EN_Pos) /*!< Bit mask of  */

/* Bit 1 : BIT_CKE_CORDIC. CORDIC clock enable */
#define SYSBLK_CODEC_CLK_EN_Pos (1UL) /*!< Position of  */
#define SYSBLK_CODEC_CLK_EN_Msk (0x1UL << SYSBLK_CODEC_CLK_EN_Pos) /*!< Bit mask of  */

/* Bit 0 : BIT_CKE_HWSPI. HWSPI clock enable */
#define SYSBLK_HWSPI_CLK_EN_Pos (0UL) /*!< Position of  */
#define SYSBLK_HWSPI_CLK_EN_Msk (0x1UL << SYSBLK_HWSPI_CLK_EN_Pos) /*!< Bit mask of  */
#define SYSBLK_ADC_EN_Msk (0x1UL << SYSBLK_ADC_EN_Pos) /*!< Bit mask of  */


/* Register: REG_PESOC_PERI_CLK_CTRL0 */
/* Description: REG_PESOC_PERI_CLK_CTRL0. */

/* Bit 21 : BIT_SOC_SLPCK_IR_EN. 1: IR clock enable when CPU sleep command */
#define SYSBLK_SLPCK_IR_EN_Pos (21UL) /*!< Position of  */
#define SYSBLK_SLPCK_IR_EN_Msk (0x1UL << SYSBLK_SLPCK_IR_EN_Pos) /*!< Bit mask of  */

/* Bit 20 : BIT_SOC_ACTCK_IR_EN */
#define SYSBLK_ACTCK_IR_EN_Pos (20UL) /*!< Position of  */
#define SYSBLK_ACTCK_IR_EN_Msk (0x1UL << SYSBLK_ACTCK_IR_EN_Pos) /*!< Bit mask of  */

/* Bit 19 : BIT_SOC_SLPCK_SPI1_EN */
#define SYSBLK_SLPCK_SPI1_EN_Pos (19UL) /*!< Position of  */
#define SYSBLK_SLPCK_SPI1_EN_Msk (0x1UL << SYSBLK_SLPCK_SPI1_EN_Pos) /*!< Bit mask of  */

/* Bit 18 : BIT_SOC_ACTCK_SPI1_EN */
#define SYSBLK_ACTCK_SPI1_EN_Pos (18UL) /*!< Position of  */
#define SYSBLK_ACTCK_SPI1_EN_Msk (0x1UL << SYSBLK_ACTCK_SPI1_EN_Pos) /*!< Bit mask of  */

/* Bit 17 : BIT_SOC_SLPCK_SPI0_EN */
#define SYSBLK_SLPCK_SPI0_EN_Pos (17UL) /*!< Position of  */
#define SYSBLK_SLPCK_SPI0_EN_Msk (0x1UL << SYSBLK_SLPCK_SPI0_EN_Pos) /*!< Bit mask of  */

/* Bit 16 : BIT_SOC_ACTCK_SPI0_EN */
#define SYSBLK_ACTCK_SPI0_EN_Pos (16UL) /*!< Position of  */
#define SYSBLK_ACTCK_SPI0_EN_Msk (0x1UL << SYSBLK_ACTCK_SPI0_EN_Pos) /*!< Bit mask of  */

