ART-Badge/SDK/libraries/inc/peripheral/rtl876x_bitfields.h
/* Bit 3 : BIT_SOC_SLPCK_UART1_HCI_EN */
#define SYSBLK_SLPCK_UART1HCI_EN_Pos (3UL) /*!< Position of  */
#define SYSBLK_SLPCK_UART1HCI_EN_Msk (0x1UL << SYSBLK_SLPCK_UART1HCI_EN_Pos) /*!< Bit mask of  */

/* Bit 2 : BIT_SOC_ACTCK_UART1_HCI_EN */
#define SYSBLK_ACTCK_UART1HCI_EN_Pos (2UL) /*!< Position of  */
#define SYSBLK_ACTCK_UART1HCI_EN_Msk (0x1UL << SYSBLK_ACTCK_UART1HCI_EN_Pos) /*!< Bit mask of  */

/* Bit 1 : BIT_SOC_SLPCK_UART0_DATA_EN */
#define SYSBLK_SLPCK_UART0DATA_EN_Pos (1UL) /*!< Position of  */
#define SYSBLK_SLPCK_UART0DATA_EN_Msk (0x1UL << SYSBLK_SLPCK_UART0DATA_EN_Pos) /*!< Bit mask of  */

/* Bit 0 : BIT_SOC_ACTCK_UART0_DATA_EN */
#define SYSBLK_ACTCK_UART0DATA_EN_Pos (0UL) /*!< Position of  */
#define SYSBLK_ACTCK_UART0DATA_EN_Msk (0x1UL << SYSBLK_ACTCK_UART0DATA_EN_Pos) /*!< Bit mask of  */


/* Register: REG_PESOC_PERI_CLK_CTRL1 */
/* Description: REG_PESOC_PERI_CLK_CTRL1. */

/* Bit 31 : r_CODEC_CLK_10M_EN. Codec 10MHz clock source enable */
#define SYSBLK_CODEC_CLK10M_EN_Pos (31UL) /*!< Position of  */
#define SYSBLK_CODEC_CLK10M_EN_Msk (0x1UL << SYSBLK_CODEC_CLK10M_EN_Pos) /*!< Bit mask of  */

/* Bit 30 : r_CODEC_CLK_40M_EN */
#define SYSBLK_CODEC_CLK40M_EN_Pos (30UL) /*!< Position of  */
#define SYSBLK_CODEC_CLK40M_EN_Msk (0x1UL << SYSBLK_CODEC_CLK40M_EN_Pos) /*!< Bit mask of  */

/* Bit 25 : BIT_SOC_SLPCK_ADC_EN */
#define SYSBLK_SLPCK_ADC_EN_Pos (25UL) /*!< Position of  */
#define SYSBLK_SLPCK_ADC_EN_Msk (0x1UL << SYSBLK_SLPCK_ADC_EN_Pos) /*!< Bit mask of  */

/* Bit 24 : BIT_SOC_ACTCK_ADC_EN */
#define SYSBLK_ACTCK_ADC_EN_Pos (24UL) /*!< Position of  */
#define SYSBLK_ACTCK_ADC_EN_Msk (0x1UL << SYSBLK_ACTCK_ADC_EN_Pos) /*!< Bit mask of  */

/* Bit 17 : BIT_SOC_SLPCK_SPI_3WIRE_EN */
#define SYSBLK_SLPCK_SPI2WIRE_EN_Pos (17UL) /*!< Position of  */
#define SYSBLK_SLPCK_SPI2WIRE_EN_Msk (0x1UL << SYSBLK_SLPCK_SPI2WIRE_EN_Pos) /*!< Bit mask of  */

/* Bit 16 : BIT_SOC_ACTCK_SPI_3WIRE_EN */
#define SYSBLK_ACTCK_SPI2WIRE_EN_Pos (16UL) /*!< Position of  */
#define SYSBLK_ACTCK_SPI2WIRE_EN_Msk (0x1UL << SYSBLK_ACTCK_SPI2WIRE_EN_Pos) /*!< Bit mask of  */

/* Bit 7 : BIT_SOC_SLPCK_KEYSCAN_EN */
#define SYSBLK_SLPCK_KEYSCAN_EN_Pos (7UL) /*!< Position of  */
#define SYSBLK_SLPCK_KEYSCAN_EN_Msk (0x1UL << SYSBLK_SLPCK_KEYSCAN_EN_Pos) /*!< Bit mask of  */

/* Bit 6 : BIT_SOC_ACTCK_KEYSCAN_EN */
#define SYSBLK_ACTCK_KEYSCAN_EN_Pos (6UL) /*!< Position of  */
#define SYSBLK_ACTCK_KEYSCAN_EN_Msk (0x1UL << SYSBLK_ACTCK_KEYSCAN_EN_Pos) /*!< Bit mask of  */

/* Bit 5 : BIT_SOC_SLPCK_QDECODE_EN */
#define SYSBLK_SLPCK_QDECODE_EN_Pos (5UL) /*!< Position of  */
#define SYSBLK_SLPCK_QDECODE_EN_Msk (0x1UL << SYSBLK_SLPCK_QDECODE_EN_Pos) /*!< Bit mask of  */

/* Bit 4 : BIT_SOC_ACTCK_QDECODE_EN */
#define SYSBLK_ACTCK_QDECODE_EN_Pos (4UL) /*!< Position of  */
#define SYSBLK_ACTCK_QDECODE_EN_Msk (0x1UL << SYSBLK_ACTCK_QDECODE_EN_Pos) /*!< Bit mask of  */

/* Bit 3 : BIT_SOC_SLPCK_I2C1_EN */
#define SYSBLK_SLPCK_I2C1_EN_Pos (3UL) /*!< Position of  */
#define SYSBLK_SLPCK_I2C1_EN_Msk (0x1UL << SYSBLK_SLPCK_I2C1_EN_Pos) /*!< Bit mask of  */

/* Bit 2 : BIT_SOC_ACTCK_I2C1_EN */
#define SYSBLK_ACTCK_I2C1_EN_Pos (2UL) /*!< Position of  */
#define SYSBLK_ACTCK_I2C1_EN_Msk (0x1UL << SYSBLK_ACTCK_I2C1_EN_Pos) /*!< Bit mask of  */

/* Bit 1 : BIT_SOC_SLPCK_I2C0_EN */
#define SYSBLK_SLPCK_I2C0_EN_Pos (1UL) /*!< Position of  */
#define SYSBLK_SLPCK_I2C0_EN_Msk (0x1UL << SYSBLK_SLPCK_I2C0_EN_Pos) /*!< Bit mask of  */

/* Bit 0 : BIT_SOC_ACTCK_I2C0_EN */
#define SYSBLK_ACTCK_I2C0_EN_Pos (0UL) /*!< Position of  */
#define SYSBLK_ACTCK_I2C0_EN_Msk (0x1UL << SYSBLK_ACTCK_I2C0_EN_Pos) /*!< Bit mask of  */


/* Register: REG_PESOC_COM_CLK_CTRL1 */
/* Description: REG_PESOC_COM_CLK_CTRL1. */

/* Bit 1 : BIT_SOC_SLPCK_BTBUS_EN. 1: BTBUS clock enable when CPU sleep mode */
#define SYSBLK_SLPCK_BTBUS_EN_Pos (1UL) /*!< Position of  */
#define SYSBLK_SLPCK_BTBUS_EN_Msk (0x1UL << SYSBLK_SLPCK_BTBUS_EN_Pos) /*!< Bit mask of  */

/* Bit 0 : BIT_SOC_ACTCK_BTBUS_EN. 1: BTBUS clock enable in CPU run mode */
#define SYSBLK_ACTCK_BTBUS_EN_Pos (0UL) /*!< Position of  */
#define SYSBLK_ACTCK_BTBUS_EN_Msk (0x1UL << SYSBLK_ACTCK_BTBUS_EN_Pos) /*!< Bit mask of  */


/****************************************************************************************************************/
/* Peripheral: Quad Decoder */
/* Description: Quad Decoder */



#ifdef __cplusplus
}
#endif

#endif

